fixtures/route-request.xml

<?xml version="1.0" encoding="utf-8"?>
<!-- PLACEHOLDER. SOAPAction: http://tempuri.org/IRouting/RouteDeliveryRateLandedCost
     rData element names are the unconfirmed stubbed mapping #1 (InboundFieldMap.cs). -->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <wsse:Security soap:mustUnderstand="1"
                   xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" />
  </soap:Header>
  <soap:Body>
    <RouteDeliveryRateLandedCost xmlns="http://tempuri.org/">
      <rData>
        <accountNumber>ACME</accountNumber>
        <destinationCountryCode>GB</destinationCountryCode>
        <weight>3.2</weight>
        <weightUOM>Kilograms</weightUOM>
        <length>20</length>
        <width>15</width>
        <height>10</height>
        <dimensionUOM>Centimeters</dimensionUOM>
        <packageValue>500.00</packageValue>
      </rData>
    </RouteDeliveryRateLandedCost>
  </soap:Body>
</soap:Envelope>
